<?php defined('BASEPATH') OR exit('No direct script access allowed');

$config['table_map'] = array(
    'account_log' => array(
    //分表映射关系
    	//2015
	  	'20150601-20150630' => 'account_log_201506',
		'20150701-20150731' => 'account_log_201507',
		'20150801-20150831' => 'account_log_201508',
		'20150901-20150930' => 'account_log_201509',
		'20151001-20151031' => 'account_log_201510',
		'20151101-20151130' => 'account_log_201511',
		'20151201-20151231' => 'account_log_201512',
		//2016
		'20160101-20160131' => 'account_log_201601',
		'20160201-20160230' => 'account_log_201602',
		'20160301-20160331' => 'account_log_201603',
		'20160401-20160430' => 'account_log_201604',
		'20160501-20160531' => 'account_log_201605',
		'20160601-20160630' => 'account_log_201606',
		'20160701-20160731' => 'account_log_201607',
		'20160801-20160831' => 'account_log_201608',
		'20160901-20160930' => 'account_log_201609',
		'20161001-20161031' => 'account_log_201610',
		'20161101-20161130' => 'account_log_201611',
		'20161201-20161231' => 'account_log_201612',
    ),
);
